tutorials/fluidSolidInteraction/HronTurekFsi3.jfnk/system/solid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
   (248.9898 190 0)
   (299.5733 190 0)
   (600 190 0)
   (600 210 0)
   (299.5733 210 0)
   (248.9898 210 0)

   (248.9898 190 15)
   (299.5733 190 15)
   (600 190 15)
   (600 210 15)
   (299.5733 210 15)
   (248.9898 210 15)
);

blocks
(
    //
    //    5,11   4,10   3,9
    //
    //    0,6    1,7    2,8
    //
    // mesh 1
    // hex (0 1 4 5 6 7 10 11) (20 4 1) simpleGrading (4 1 1)
    // hex (1 2 3 4 7 8 9 10) (60 4 1) simpleGrading (1 1 1)

    // mesh 2
    hex (0 1 4 5 6 7 10 11) (20 8 1) simpleGrading (4 1 1)
    hex (1 2 3 4 7 8 9 10) (60 8 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
     patch plateFix
     (
         (0 6 11 5)
     )

     patch plate
     (
         (0 1 7 6)
         (1 2 8 7)
         (2 3 9 8)
         (10 9 3 4)
         (11 10 4 5)
     )

     empty frontAndBackPlanes
     (
         (5 4 1 0)
         (4 3 2 1)
         (6 7 10 11)
         (7 8 9 10)
     )
);

mergePatchPairs
(
);

// ************************************************************************* //
