tutorials/fluidSolidInteraction/HronTurekFsi3.jfnk/constant/fluid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//solidModel    linearGeometryTotalDisplacement;
//solidModel    nonLinearGeometryTotalLagrangianTotalDisplacement;
//solidModel    diffusionSolid;
solidModel    nonLinearGeometryTotalLagrangianTotalDisplacement;

"diffusionSolidCoeffs|linearGeometryTotalDisplacementCoeffs|nonLinearGeometryTotalLagrangianTotalDisplacementCoeffs"
{
    // solvePressure yes;
    // pressureSmoothingCoeff 1e2;

    // Solution algorithm
    //solutionAlgorithm implicitSegregated;
    solutionAlgorithm PETScSNES;
    //solutionAlgorithm explicit;

    // PETSc options file used by PETScSNES
    optionsFile petscOptions.lu;

    // Predictor D at the start of a new time step using U and A
    //predictor yes;

    stabilisation
    {
        type    RhieChow;
        scaleFactor 1.0;
    }
}

// ************************************************************************* //
